{
  "upload_type": "software",
  "title": "Reciprocal Collision Avoidance with Acceleration-Velocity Obstacles",
  "creators": [
    {
      "name": "Van den Berg, Jur",
      "affiliation": "University of North Carolina at Chapel Hill",
    },
    {
      "name": "Snape, Jamie",
      "affiliation": "University of North Carolina at Chapel Hill",
      "orcid": "0000-0002-3326-9765",
    },
    {
      "name": "Guy, Stephen J.",
      "affiliation": "University of North Carolina at Chapel Hill",
      "orcid": "0000-0001-8986-5817"
    },
    {
      "name": "Manocha, Dinesh",
      "affiliation": "University of North Carolina at Chapel Hill",
      "orcid": "0000-0001-7047-9801"
    }
  ],
  "description": "We present an approach for collision avoidance for mobile robots that takes into account acceleration constraints. We discuss both the case of navigating a single robot among moving obstacles, and the case of multiple robots reciprocally avoiding collisions with each other while navigating a common workspace. Inspired by the concept of velocity obstacles, we introduce the acceleration-velocity obstacle (AVO) to let a robot avoid collisions with moving obstacles while obeying acceleration constraints. AVO characterizes the set of new velocities the robot can safely reach and adopt using proportional control of the acceleration. We extend this concept to reciprocal collision avoidance for multi-robot settings, by letting each robot take half of the responsibility of avoiding pairwise collisions. Our formulation guarantees collision-free navigation even as the robots act independently and simultaneously, without coordination. Our approach is designed for holonomic robots, but can also be applied to kinematically constrained non-holonomic robots such as cars. We have implemented our approach, and we show simulation results in challenging environments with large numbers of robots and obstacles.",
  "access_right": "open",
  "license": {
    "id": "Apache-2.0",
    "title": "Apache License 2.0",
    "url": "https://www.apache.org/licenses/LICENSE-2.0"
  },
  "keywords": [
    "collision avoidance",
    "mobile robots",
    "motion planning",
    "multi-robot systems",
    "navigation"
  ],
  "grants": [
    {
      "id": "10.13039/100000001::0636208"
    },
    {
      "id": "10.13039/100000001::0917040"
    },
    {
      "id": "10.13039/100000001::0904990"
    }
  ]
}
